Enums/рс_ВидОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>рс_ВидОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подсистемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеМодули</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодпискиНаСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентныеЗадания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяемыеТипы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеКоманды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппыКоманд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеМакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Константы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/рс_Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Объекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Подсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_Изменения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>рс_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>рс_Связь</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлгоритмЗаполнение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>рс_ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ТабличныеЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>рс_Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Форма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроцедурыФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Регистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АС_Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщийМодульСервер/Ext/Module.bsl
//Структура 
//Структура "Сервер"			,ИмяСервера);
//Структура "База"				,ИмяБазы);
//Структура "Пользователь"		,ИмяПользователя);
//Структура "Пароль"			,Пароль);
//
Функция ПодключитьсяКбазе(Структура) Экспорт
	
	СтрокаПодключения = "Srvr="+Структура.Сервер+"; Ref="+Структура.База+"; Usr="+Структура.Пользователь+"; Pwd="+Структура.Пароль+";";
	ПараметрыПодключенияКлиентСервернойИБ = СтрокаПодключения;
	//"Srvr=serv1c; Ref=buh_51346332; Usr=roman; Pwd=roman;";
	
	V83COMCon = Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMCon.Connect(ПараметрыПодключенияКлиентСервернойИБ);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции 

Функция ПодключитьсяКТекущейбазе(Ссылка) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Сервер"			,Ссылка.ИмяСервера);
	Структура.Вставить("База"			,Ссылка.ИмяБазы);
	Структура.Вставить("Пользователь"	,Ссылка.ИмяПользователя);
	Структура.Вставить("Пароль"			,Ссылка.Пароль);
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКбазе(Структура);  
	
	Возврат Соединение;
КонецФункции

//Ссылка - Ссылка на Объект
//ИБ 	 - СОМ соединение
//
Процедура ЗаполнитьРеквизитыОбъекта(Ссылка, ИБ) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.рс_Реквизиты.Очистить(); 
	
	Соединение = ПодключитьсяКТекущейбазе(ИБ);
	
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, Строка(СпрОбъект.Вид));
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.рс_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено); 
	Структура.Вставить("ИБ"		, Соединение);
	
	ЗаполнитьРеквизиты(Структура); 
	
	Для Каждого Метаданное Из Соединение.Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ = Метаданное.Имя;
		ТабЧасть =  Справочники.рс_ТабличнаяЧасть.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = Создать_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизиты(Структура);
	КонецЦикла;	
	
	СпрОбъект.Записать();
		
КонецПроцедуры     

//	Структура "тВид"	, Строка(СпрОбъект.Вид));
//	Структура "ИД"		, СпрОбъект.Индентификатор);
//	Структура "Табл"	, СпрОбъект.рс_Реквизиты);
//	Структура "ТЧ"		, Неопределено); 
//	Структура "ИБ"		, ИБ);
//
Процедура ЗаполнитьРеквизиты(Структура) Экспорт 
     ИБ = Структура.ИБ; 
	 
	Для Каждого Метаданное Из ИБ.Метаданные[Структура.тВид][Структура.ИД].Реквизиты Цикл 
		НовСтрока = Структура.Табл.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;
		
		Если Не Структура.ТЧ = Неопределено Тогда 
			НовСтрока.рс_ТабличнаяЧасть = Структура.ТЧ;
		КонецЕсли;	
		
		ТипыР = Метаданное.Тип.Типы(); 
		ТипР = "";
		
		//--Временно пока не понятно как--
		//
		//Для Каждого стрТип Из ТипыР Цикл 			
		//	ПоискТип = Метаданные.НайтиПоТипу(стрТип);
		//	Если ПоискТип = Неопределено Тогда 
		//		РеквизитТип 		= Метаданное.Тип;	
		//	Иначе 	
		//		ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
		//		РеквизитТип = ТипР;		
		//	КонецЕсли;
		//КонецЦикла;
		//
		//НовСтрока.РеквизитТип 			= РеквизитТип; 		 
		НовСтрока.ПроверкаЗаполнения 	= Метаданное.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку; 			
	
	КонецЦикла;

КонецПроцедуры

Функция Создать_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.рс_ТабличнаяЧасть.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_ТабличнаяЧасть.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка; 
	 
 КонецФункции
 
Функция НайтиСправочникОбъект(Наименование) Экспорт
	
	СправочникСсылка = Справочники.рс_Объекты.ПустаяСсылка();
	
	 СправочникСсылка = Справочники.рс_Объекты.НайтиПоНаименованию(Наименование);
	
	Возврат СправочникСсылка; 
	
КонецФункции	 

Функция НайтиОбъект(Тип, Наименование) Экспорт
	
	Если Тип = "Catalogs" Тогда 
		 Вид = Перечисления.рс_ВидОбъектов.Справочники;
	КонецЕсли;
	
	СправочникСсылка = Справочники.рс_Объекты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рс_Объекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.рс_Объекты КАК рс_Объекты
		|ГДЕ
		|	рс_Объекты.Вид = &Вид
		|	И рс_Объекты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Вид", Вид);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
		
	Возврат СправочникСсылка; 
	
КонецФункции

Функция СоздатьОбъект(Структура)  Экспорт 
	
	Нов_Объект = Справочники.рс_Объекты.СоздатьЭлемент();	
	Нов_Объект.Индентификатор 		= Структура.Индентификатор;
	Нов_Объект.Наименование  		= Структура.Наименование; 
	Нов_Объект.Вид            		= Структура.Вид;
	Нов_Объект.Подсистема     		= Структура.Подсистема;
	Нов_Объект.ИнформационнаяБаза 	= Структура.СправочникИБ;
	
	Нов_Объект.Записать();
	
	ЗаполнитьРеквизитыОбъекта(Нов_Объект.Ссылка, Структура.ИнформационнаяБаза);

	Возврат Нов_Объект.Ссылка;
	
КонецФункции
